import type {Clazz} from "../types/Character.ts";

export const Classes: Clazz[] = [
  {
    "素性": "放浪騎士",
    "レベル": 9,
    "生命力": 15,
    "精神力": 10,
    "持久力": 11,
    "筋力": 14,
    "技量": 13,
    "知力": 9,
    "信仰": 9,
    "神秘": 7
  },
  {
    "素性": "剣士",
    "レベル": 8,
    "生命力": 11,
    "精神力": 12,
    "持久力": 11,
    "筋力": 10,
    "技量": 16,
    "知力": 10,
    "信仰": 8,
    "神秘": 9
  },
  {
    "素性": "勇者",
    "レベル": 7,
    "生命力": 14,
    "精神力": 9,
    "持久力": 12,
    "筋力": 16,
    "技量": 9,
    "知力": 7,
    "信仰": 8,
    "神秘": 11
  },
  {
    "素性": "盗賊",
    "レベル": 5,
    "生命力": 10,
    "精神力": 11,
    "持久力": 10,
    "筋力": 9,
    "技量": 13,
    "知力": 9,
    "信仰": 8,
    "神秘": 14
  },
  {
    "素性": "星見",
    "レベル": 6,
    "生命力": 9,
    "精神力": 15,
    "持久力": 9,
    "筋力": 8,
    "技量": 12,
    "知力": 16,
    "信仰": 7,
    "神秘": 9
  },
  {
    "素性": "預言者",
    "レベル": 7,
    "生命力": 10,
    "精神力": 14,
    "持久力": 8,
    "筋力": 11,
    "技量": 10,
    "知力": 7,
    "信仰": 16,
    "神秘": 10
  },
  {
    "素性": "侍",
    "レベル": 9,
    "生命力": 12,
    "精神力": 11,
    "持久力": 13,
    "筋力": 12,
    "技量": 15,
    "知力": 9,
    "信仰": 8,
    "神秘": 8
  },
  {
    "素性": "囚人",
    "レベル": 9,
    "生命力": 11,
    "精神力": 12,
    "持久力": 11,
    "筋力": 11,
    "技量": 14,
    "知力": 14,
    "信仰": 6,
    "神秘": 9
  },
  {
    "素性": "密使",
    "レベル": 10,
    "生命力": 10,
    "精神力": 13,
    "持久力": 10,
    "筋力": 12,
    "技量": 12,
    "知力": 9,
    "信仰": 14,
    "神秘": 9
  },
  {
    "素性": "素寒貧",
    "レベル": 1,
    "生命力": 10,
    "精神力": 10,
    "持久力": 10,
    "筋力": 10,
    "技量": 10,
    "知力": 10,
    "信仰": 10,
    "神秘": 10
  }
]
